; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v8 ?v7)
             (pred_6 ?v11 ?v9)
             (pred_2 ?v8 ?v9)
             (pred_7 ?v1 ?v8 )
	     (pred_8 ?v8)
             (pred_11 ?v13)
             (pred_10 ?v11)
             (pred_12 ?v9)
             (pred_4 ?v8)
             (pred_5 ?v11)
             (pred_1 ?v8)
             (pred_9 ))



(:action op_3
:parameters (?v12 ?v2 ?v6 ?v10)
:precondition (and (pred_11 ?v12) (pred_11 ?v2) (pred_10 ?v6) (pred_12 ?v10)
          (pred_3 ?v12 ?v2) (pred_6 ?v6 ?v10)
                   (pred_2 ?v2 ?v10) (pred_8 ?v12) 
                   (pred_4 ?v2) (pred_5 ?v6))
:effect (and  (pred_1 ?v2) (not (pred_4 ?v2))))


(:action op_2
:parameters (?v12 ?v5)
:precondition (and (pred_11 ?v12) (pred_11 ?v5)
               (pred_8 ?v12) (pred_3 ?v12 ?v5) (pred_1 ?v5))
:effect (and (pred_8 ?v5) (not (pred_8 ?v12))))

(:action op_1
:parameters (?v12 ?v6)
:precondition (and (pred_11 ?v12) (pred_10 ?v6) 
                  (pred_8 ?v12) (pred_7 ?v6 ?v12) (pred_9 ))
:effect (and (pred_5 ?v6)
   (not (pred_7 ?v6 ?v12)) (not (pred_9 ))))


(:action op_5
:parameters (?v12 ?v3 ?v4)
:precondition (and (pred_11 ?v12) (pred_10 ?v3) (pred_10 ?v4)
                  (pred_8 ?v12) (pred_5 ?v4) (pred_7 ?v3 ?v12))
:effect (and (pred_5 ?v3) (pred_7 ?v4 ?v12)
        (not (pred_5 ?v4)) (not (pred_7 ?v3 ?v12))))

(:action op_4
:parameters (?v12 ?v6)
:precondition (and (pred_11 ?v12) (pred_10 ?v6) 
                  (pred_8 ?v12) (pred_5 ?v6))
:effect (and (pred_9 ) (pred_7 ?v6 ?v12) (not (pred_5 ?v6)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_02 obj_11 obj_19 obj_01 obj_07 obj_15 obj_16 obj_05 obj_18 obj_12 obj_13 obj_03 obj_08 obj_06 obj_10 obj_17
    obj_20 obj_09
    obj_04 obj_14
    )

    (:init
       (pred_9)

       (pred_11 obj_02)
       (pred_11 obj_11)
       (pred_11 obj_19)
       (pred_11 obj_01)
       (pred_11 obj_07)
       (pred_11 obj_15)
       (pred_11 obj_16)
       (pred_11 obj_05)
       (pred_11 obj_18)
       (pred_11 obj_12)
       (pred_11 obj_13)
       (pred_11 obj_03)
       (pred_11 obj_08)
       (pred_11 obj_06)
       (pred_11 obj_10)
       (pred_11 obj_17)
       (pred_12 obj_20)
       (pred_12 obj_09)
       (pred_10 obj_04)
       (pred_10 obj_14)

       (pred_3 obj_02 obj_07)
       (pred_3 obj_02 obj_11)
       (pred_3 obj_11 obj_15)
       (pred_3 obj_11 obj_19)
       (pred_3 obj_11 obj_02)
       (pred_3 obj_19 obj_16)
       (pred_3 obj_19 obj_01)
       (pred_3 obj_19 obj_11)
       (pred_3 obj_01 obj_05)
       (pred_3 obj_01 obj_19)
       (pred_3 obj_07 obj_18)
       (pred_3 obj_07 obj_15)
       (pred_3 obj_07 obj_02)
       (pred_3 obj_15 obj_12)
       (pred_3 obj_15 obj_16)
       (pred_3 obj_15 obj_11)
       (pred_3 obj_15 obj_07)
       (pred_3 obj_16 obj_13)
       (pred_3 obj_16 obj_05)
       (pred_3 obj_16 obj_19)
       (pred_3 obj_16 obj_15)
       (pred_3 obj_05 obj_03)
       (pred_3 obj_05 obj_01)
       (pred_3 obj_05 obj_16)
       (pred_3 obj_18 obj_08)
       (pred_3 obj_18 obj_12)
       (pred_3 obj_18 obj_07)
       (pred_3 obj_12 obj_06)
       (pred_3 obj_12 obj_13)
       (pred_3 obj_12 obj_15)
       (pred_3 obj_12 obj_18)
       (pred_3 obj_13 obj_10)
       (pred_3 obj_13 obj_03)
       (pred_3 obj_13 obj_16)
       (pred_3 obj_13 obj_12)
       (pred_3 obj_03 obj_17)
       (pred_3 obj_03 obj_05)
       (pred_3 obj_03 obj_13)
       (pred_3 obj_08 obj_06)
       (pred_3 obj_08 obj_18)
       (pred_3 obj_06 obj_10)
       (pred_3 obj_06 obj_12)
       (pred_3 obj_06 obj_08)
       (pred_3 obj_10 obj_17)
       (pred_3 obj_10 obj_13)
       (pred_3 obj_10 obj_06)
       (pred_3 obj_17 obj_03)
       (pred_3 obj_17 obj_10)
       (pred_4 obj_02)
       (pred_4 obj_06)
       (pred_2  obj_02 obj_20)
       (pred_2  obj_06 obj_09)
       (pred_1 obj_11)
       (pred_1 obj_19)
       (pred_1 obj_01)
       (pred_1 obj_07)
       (pred_1 obj_15)
       (pred_1 obj_16)
       (pred_1 obj_05)
       (pred_1 obj_18)
       (pred_1 obj_12)
       (pred_1 obj_13)
       (pred_1 obj_03)
       (pred_1 obj_08)
       (pred_1 obj_10)
       (pred_1 obj_17)

       (pred_6  obj_04 obj_20)
       (pred_6  obj_14 obj_09)
       (pred_7 obj_04 obj_03)
       (pred_7 obj_14 obj_19)
       (pred_8 obj_16)
    )

    (:goal (and
       (pred_7 obj_04 obj_18)
       (pred_7 obj_14 obj_08)
    ))
(:constraints
  (always (not (pred_8 obj_15)))
)
)

; plan
1. (op_2 obj_16 obj_13)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_13)
   goals met: 0 of 2
2. (op_2 obj_13 obj_03)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_03)
   goals met: 0 of 2
3. (op_1 obj_03 obj_04)
   deleted: (pred_7 obj_04 obj_03) (pred_9)
   added: (pred_5 obj_04)
   goals met: 0 of 2
4. (op_2 obj_03 obj_13)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_13)
   goals met: 0 of 2
5. (op_2 obj_13 obj_12)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_12)
   goals met: 0 of 2
6. (op_2 obj_12 obj_18)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_18)
   goals met: 0 of 2
7. (op_4 obj_18 obj_04)
   deleted: (pred_5 obj_04)
   added: (pred_9) (pred_7 obj_04 obj_18)
   goals met: 1 of 2
8. (op_2 obj_18 obj_12)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_12)
   goals met: 1 of 2
9. (op_2 obj_12 obj_13)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_13)
   goals met: 1 of 2
10. (op_2 obj_13 obj_16)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_16)
   goals met: 1 of 2
11. (op_2 obj_16 obj_19)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_19)
   goals met: 1 of 2
12. (op_1 obj_19 obj_14)
   deleted: (pred_7 obj_14 obj_19) (pred_9)
   added: (pred_5 obj_14)
   goals met: 1 of 2
13. (op_2 obj_19 obj_16)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_16)
   goals met: 1 of 2
14. (op_2 obj_16 obj_13)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_13)
   goals met: 1 of 2
15. (op_2 obj_13 obj_12)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_12)
   goals met: 1 of 2
16. (op_2 obj_12 obj_18)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_18)
   goals met: 1 of 2
17. (op_2 obj_18 obj_08)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_08)
   goals met: 1 of 2
18. (op_4 obj_08 obj_14)
   deleted: (pred_5 obj_14)
   added: (pred_9) (pred_7 obj_14 obj_08)
   goals met: 2 of 2
